In [ ]:
#Exercise 1

In [1]:
import pandas as pd

<ipython-input-1-7dd3504c366f>:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
student_data=pd.DataFrame(
    {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [23, 25, 22, 24, 23],
    'Gender': ['F', 'M', 'M', 'M', 'F'],
    'Score': [85, 78, 92, 70, 88]})

In [3]:
student_data

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [4]:
student_data.loc[0:3]

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70

In [5]:
stu_Filter=student_data[student_data['Gender']=='F']

In [6]:
stu_Filter

    Name  Age Gender  Score
0  Alice   23      F     85
4    Eva   23      F     88

In [7]:
student_data['Score1']=student_data['Score']
student_data['Score2']=student_data['Score']
student_data['Age1']=student_data['Age']

In [8]:
student_data

      Name  Age Gender  Score  Score1  Score2  Age1
0    Alice   23      F     85      85      85    23
1      Bob   25      M     78      78      78    25
2  Charlie   22      M     92      92      92    22
3    David   24      M     70      70      70    24
4      Eva   23      F     88      88      88    23

In [9]:
student_data.drop('Age1',axis=1)

      Name  Age Gender  Score  Score1  Score2
0    Alice   23      F     85      85      85
1      Bob   25      M     78      78      78
2  Charlie   22      M     92      92      92
3    David   24      M     70      70      70
4      Eva   23      F     88      88      88

In [10]:
student_data=student_data.drop('Age1',axis=1)
student_data=student_data.drop(columns=['Score1','Score2'],axis=1)

In [11]:
student_data

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
3    David   24      M     70
4      Eva   23      F     88

In [12]:
student_data=student_data.drop(3,axis=0)

In [13]:
student_data

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92
4      Eva   23      F     88

In [14]:
stu_Fil=student_data[(student_data['Gender']=='F') & (student_data['Score']>85)]

In [15]:
stu_Fil

  Name  Age Gender  Score
4  Eva   23      F     88

In [16]:
stu_Fil=student_data[(student_data['Gender']=='F') & (student_data['Score']>75)]

In [17]:
stu_Fil

    Name  Age Gender  Score
0  Alice   23      F     85
4    Eva   23      F     88

In [18]:
student_data.sort_values(by='Score',ascending=False,inplace=True)

In [19]:
student_data

      Name  Age Gender  Score
2  Charlie   22      M     92
4      Eva   23      F     88
0    Alice   23      F     85
1      Bob   25      M     78

In [23]:
def Grading(Score):
    if Score >= 90:
        return 'A'
    elif Score <= 90 and Score >= 80:
        return 'B'
    elif Score <= 80 and Score >= 70:
        return 'C'
    elif Score <= 70 and Score >= 60:
        return 'D'
    else:
        return 'F'

student_data['Grade']=student_data['Score'].apply(Grading)

In [21]:
student_data

      Name  Age Gender  Score Grade
2  Charlie   22      M     92     O
4      Eva   23      F     88     A
0    Alice   23      F     85     A
1      Bob   25      M     78     B

In [25]:
sales=pd.DataFrame(
    {'Month': ['Jan', 'Feb', 'Mar', 'Jan', 'Feb', 'Mar'],
    'Product': ['A', 'A', 'A', 'B', 'B', 'B'],
    'Sales': [150, 200, 250, 300, 400, 500]}
)

In [26]:
sales

  Month Product  Sales
0   Jan       A    150
1   Feb       A    200
2   Mar       A    250
3   Jan       B    300
4   Feb       B    400
5   Mar       B    500

In [27]:
sales.groupby('Product').sum('Sales')

         Sales
Product
A          600
B         1200

In [28]:
sales.loc[sales.groupby('Product')['Sales'].idxmax()]

  Month Product  Sales
2   Mar       A    250
5   Mar       B    500

In [30]:
total=sales.groupby('Product')['Sales'].transform('sum')
sales['Percentage']=(sales['Sales']/total)*100
sales

  Month Product  Sales  Percentage
0   Jan       A    150   25.000000
1   Feb       A    200   33.333333
2   Mar       A    250   41.666667
3   Jan       B    300   25.000000
4   Feb       B    400   33.333333
5   Mar       B    500   41.666667

In [32]:
emp=pd.DataFrame(
    {'Name': ['John', 'Doe', 'Jane', 'Anna', 'Smith'],
    'Department': ['HR', 'Finance', None, 'IT', 'HR'],
    'Salary': [50000, 60000, 55000, None, 58000]}
)

In [33]:
emp

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [34]:
emp.isnull().sum()

Name          0
Department    1
Salary        1
dtype: int64

In [35]:
Dept=emp['Department'].mode()[0]
Dept

'HR'

In [36]:
emp['Department']=emp['Department'].fillna(value=Dept)
emp

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [38]:
Sal_mean=emp['Salary'].mean()
emp['Salary']=emp['Salary'].fillna(value=Sal_mean)
emp

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [39]:
emp.isnull().sum()

Name          0
Department    0
Salary        0
dtype: int64

In [40]:
emp=emp.dropna()
emp

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [42]:
temp = pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])
temp

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

In [43]:
mean_val=temp.mean()
median_val = temp.median()
std_val = temp.std()

In [44]:
mean_val

24.6

In [45]:
median_val

24.5

In [46]:
std_val

3.2041639575194445

In [47]:
temp_celcius = (temp-32)*5/9
temp_celcius

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

In [48]:
temp.idxmax()

5

In [49]:
temp.idxmin()

2

In [50]:
temp.sort_values(ascending=True)

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [51]:
temp.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64

In [53]:
orders = pd.DataFrame({'OrderID': [1, 2, 3, 4, 5],
'CustomerID': [101, 102, 103, 104, 101],
'Product': ['A', 'B', 'A', 'C', 'B']
})

In [54]:
orders

   OrderID  CustomerID Product
0        1         101       A
1        2         102       B
2        3         103       A
3        4         104       C
4        5         101       B

In [56]:
customers = pd.DataFrame(
    {'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']}
)
customers

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

In [57]:
merged_df = pd.merge(orders,customers,on="CustomerID")
merged_df

   OrderID  CustomerID Product     Name     Location
0        1         101       A    Alice     New York
1        2         102       B      Bob  Los Angeles
2        3         103       A  Charlie      Chicago
3        4         104       C    David      Houston
4        5         101       B    Alice     New York

In [58]:
group = merged_df.groupby('Location')['Name'].size().reset_index(name='Total Orders')
group

      Location  Total Orders
0      Chicago             1
1      Houston             1
2  Los Angeles             1
3     New York             2